{"parts":[{"content":"<a href=\"{{ pcurl('Kristofer-Brandow-Resume.pdf') }}\"><span class=\"glyphicon glyphicon-file\"><\/span> Kristofer Brandow Resume.pdf<\/a>\n<p>Email address: <a\n    href=\"mailto:kris.brandow@gmail.com\">kris.brandow@gmail.com<\/a>\n  - <a href=\"http:\/\/www.linkedin.com\/in\/kristoferbrandow\" target=\"_blank\">LinkedIn<\/a>\n  - <a href=\"http:\/\/www.github.com\/skriptble\" target=\"_blank\">GitHub<\/a>\n  - <a href=\"https:\/\/drupal.org\/user\/1683104\" target=\"_blank\">Drupal.org<\/a>\n  - <a href=\"https:\/\/twitter.com\/skriptble\" target=\"_blank\">Twitter<\/a>\n### Education\n<strong>B.A. in Creative Writing and Broadcasting and Mass Communication<\/strong>, May 2012 State University of New York at Oswego\n\n### Web Development Experience\n__Drupal Developer__, Columbia University Medical Center, New York, NY <span class=\"pull-right\">11\/2012– Present<\/span>\n\nI built websites and applications using the Drupal content management framework. I created custom\nmodules to add new functionality when necessary and configured contributed modules when applicable. I\nalso assisted in the maintenance of servers and legacy applications. I also built command line applications\nto aid in the development of websites and applications.\n* * *\n\n__Associate & Drupal Developer__, Knowledgent Group Inc.<span class=\"pull-right\">07\/2012– 10\/2012<\/span>\n\nI updated an intranet system based on Drupal, build a custom theme, and built several custom modules to\nfulfill different business needs. I also assisted the IT staff in troubleshooting issues, maintaining the\nproduction web servers, installing new software, and communicating with software vendors.\n* * *\n\n__Application Developer__, SUNY Oswego Communication Studies Dept, SUNY Oswego <span class=\"pull-right\">12\/2011– 05\/2012<\/span>\n\nThrough this project I designed, developed, and tested a reservation system originally for the\nCommunication Studies department. The system was then redesigned and expanded and modified to be\nused for the entire school of Communication Media and the Arts.\n* * *\n\n__Webmaster__,SUNY Oswego Student Association, SUNY Oswego <span class=\"pull-right\">11\/2011- Present<\/span>\n\nWorking with the Student Association I designed and developed a new website and set of web applications.\nThe main website gives general information to the public and provides a few resources for the constituents.\nAnother site was established on which a Budgeting Web Application was constructed which allowed for\nbudget proposals, recommendations, and final notices of budgets to be distributed.\n* * *\n\n__Director of Technology__, WTOP-10 TV, SUNY Oswego <span class=\"pull-right\">05\/2011 - 05\/2012<\/span>\n\nDesigned and developed a series of websites for the various departments of the station. These included web\napplications for crew sign up and registration, equipment reservation and sign out, and reservation of the\nStudio itself. Maintenance of the stations computer network including the station’s automation system.\n* * *\n\n__Lead Developer, Graphic Artist, & Webmaster__, Oswego Webisodes <span class=\"pull-right\">01\/2012 - 05\/2012<\/span>\n\nDeveloped a video intensive website for a small Webisodes Production course. This site included a main\npage and 4 smaller sites within for each of the webisodes and a behind the scenes show. The site included\nsocial media links to Twitter and Facebook.\n* * *\n\n### Professional Skills\n#### Web Development Skills\n\n- HTML, CSS, Javascript (vanilla and jQuery), and PHP\n- Website creation, design, and development with Drupal and Wordpress content management systems\n- Application creation using the Silex microframework, Symfony2 components, and Drupal (as a content management framework)\n- Drupal Theming, including custom themes built from Illustrator files and use of a Base theme such as\nOmega and Twitter Bootstrap\n- Drupal Custom Module development, use of Core API hooks, other custom module hooks, and hooks\ncreated by my own custom modules\n- Drupal Administration: Maintaining Drupal sites, updating custom & contrib modules, updating Drupal core, maintaining\na multisite install of Drupal, and updating the database\n- MongoDB, MySQL, Redis\n  - MongoDB Course Certifications\n      - [M101P: MognoDB for\n    Developers](https:\/\/s3.amazonaws.com\/edu-cert.10gen.com\/downloads\/19c3fb33a05447abadd6744082ca2e7a\/Certificate.pdf)\n      - [M101JS: MongoDB for Node.js\n    Developers](https:\/\/s3.amazonaws.com\/edu-cert.10gen.com\/downloads\/68223214580741689ab432940bf25c3c\/Certificate.pdf)\n- API design and development\n\n### System Administration Skills\n\n- MongoDB administration - [MongoDBA Course Certification](https:\/\/s3.amazonaws.com\/edu-cert.10gen.com\/downloads\/2ff838bd49ed4f49a56e64e69cea753b\/Certificate.pdf)\n- Maintaining Ubuntu & RedHat Enterprise Linux Servers\n- Maintaining MySQL and MongoDB Databases\n- Multiple version of PHP via PHP-FPM with Apache & Nginx\n- Apache & NGinx webservers\n- Memcached maintenance\n- Varnish setup, configuration, maintenance, and tuning for multiple websites\n\n#### Software Skills\n- VIM, ZSH, Bash, Chrome Developer Tools, Sequel Pro\n- Adobe After Effects, Apple Final Cut Pro, Apple Color\n- Chyron Lyric\/LyricPro (versions 8.0, 6.5 and 5), Adobe Photoshop, Adobe Premiere Pro, Flash, Encore, LiveType, Compressor\n\n### Development Environment\nI develop on Mac and Ubuntu using VIM, occasionally using TextMate or MacVim. I\nuse both Vagrant and locally installed servers and applications (using\nhomebrew).\n\n### Other Experience\n__Senior Advisor__, Vector Marketing, Albany NY <span class=\"pull-right\">July 2010 - Present<\/span>\n\nDemonstrated and sold high quality cutlery to customers. Called customers and generated my own leads.\nTrained new sales representatives and assisted the district manager with daily office duties.\n* * *\n\n__Student Association Senator__, SUNY Oswego SA, Oswego NY <span class=\"pull-right\">February 2010 - May 2012<\/span>\n\n__Student Association Senator Emeritus__, SUNY Oswego SA, Oswego NY <span class=\"pull-right\">May 2012 - Present<\/span>\n\nAs a Student Association Senator I served as the chairman of the Finance Committee. I lead the construction of the annual $1.5 million budget.\nI also updated the Student Association finance policies and laws. During my tenure I completely rewrote the budget process and laws utilizing a\nspecial committee on Finance and Appropriations. I also advocated for the students and student rights with the administration of the college.\n\nAs a Student Association Senator Emeritus I retain my speaking rights on the\nfloor of the Student Association Senate and am available for advice and\nassistance for the Student Association Senators.\n* * *\n\n### Activities\n\n- Writing\n- Learning new tricks in VIM\n- Researching new web frameworks and technologies\n\n### References\n\nReferences available upon request.\n\n","format":null}]}